'''
(№ 2710) (Е. Джобс) Дана последовательность N целых неотрицательных чисел. Необходимо определить количество пар
положительных элементов этой последовательности, сумма которых четна, при этом между элементами пары есть хотя бы
один ноль.
Входные данные. Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке натуральное
число N (1 < N < 10000) – количество чисел в последовательности. В следующих N строках записаны числа, входящие в
 последовательность, по одному в каждой строке.
Выходные данные: Программа должна вывести одно число – количество найденных пар.
Пример входного файла:
6
2
1
4
0
3
4
Для указанных входных данных искомое количество пар равно 3.
В ответе укажите два числа: сначала искомое значение для файла А, затем для файла B.
'''

import sys
sys.stdin = open('27-35a.txt')
N = int(input())
